<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introduction" data-toc-modified-id="Introduction-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introduction</a></span></li><li><span><a href="#Installation" data-toc-modified-id="Installation-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Installation</a></span></li><li><span><a href="#Introduction-to-pandas-data-structures" data-toc-modified-id="Introduction-to-pandas-data-structures-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Introduction to pandas data structures</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#Find-NaN-values" data-toc-modified-id="Find-NaN-values-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Find NaN values</a></span></li></ul></li><li><span><a href="#Read/write-data" data-toc-modified-id="Read/write-data-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Read/write data</a></span><ul class="toc-item"><li><span><a href="#We-load-data-in-CSV-format" data-toc-modified-id="We-load-data-in-CSV-format-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>We load data in CSV format</a></span></li><li><span><a href="#We-load-data-in-xlsx-format" data-toc-modified-id="We-load-data-in-xlsx-format-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>We load data in xlsx format</a></span></li><li><span><a href="#We-display-the-first-rows" data-toc-modified-id="We-display-the-first-rows-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>We display the first rows</a></span></li><li><span><a href="#We-display-the-last-rows" data-toc-modified-id="We-display-the-last-rows-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>We display the last rows</a></span></li><li><span><a href="#Visualize-a-random-sample" data-toc-modified-id="Visualize-a-random-sample-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Visualize a random sample</a></span></li></ul></li><li><span><a href="#Exploratory-analysis-of-a-dataframe" data-toc-modified-id="Exploratory-analysis-of-a-dataframe-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Exploratory analysis of a dataframe</a></span></li><li><span><a href="#Basic-operations-with-dataframes" data-toc-modified-id="Basic-operations-with-dataframes-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Basic operations with dataframes</a></span><ul class="toc-item"><li><span><a href="#We-select-a-column" data-toc-modified-id="We-select-a-column-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>We select a column</a></span></li><li><span><a href="#We-select-several-columns" data-toc-modified-id="We-select-several-columns-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>We select several columns</a></span></li><li><span><a href="#Get-the-unique-values-​​of-a-column-(ie-a-Series)" data-toc-modified-id="Get-the-unique-values-​​of-a-column-(ie-a-Series)-6.3"><span class="toc-item-num">6.3&nbsp;&nbsp;</span>Get the unique values ​​of a column (ie a Series)</a></span></li><li><span><a href="#Change-the-data-type-of-a-column" data-toc-modified-id="Change-the-data-type-of-a-column-6.4"><span class="toc-item-num">6.4&nbsp;&nbsp;</span>Change the data type of a column</a></span></li><li><span><a href="#We-filter-the-data-by-the-value-of-the-columns" data-toc-modified-id="We-filter-the-data-by-the-value-of-the-columns-6.5"><span class="toc-item-num">6.5&nbsp;&nbsp;</span>We filter the data by the value of the columns</a></span></li><li><span><a href="#Copy-a-dataframe-and-rename-columns" data-toc-modified-id="Copy-a-dataframe-and-rename-columns-6.6"><span class="toc-item-num">6.6&nbsp;&nbsp;</span>Copy a dataframe and rename columns</a></span><ul class="toc-item"><li><span><a href="#Rename-columns" data-toc-modified-id="Rename-columns-6.6.1"><span class="toc-item-num">6.6.1&nbsp;&nbsp;</span>Rename columns</a></span></li><li><span><a href="#We-can-rename-the-columns-by-crushing-the-instance-attribute...-does-this-ring-a-bell?" data-toc-modified-id="We-can-rename-the-columns-by-crushing-the-instance-attribute...-does-this-ring-a-bell?-6.6.2"><span class="toc-item-num">6.6.2&nbsp;&nbsp;</span>We can rename the columns by crushing the instance attribute... does this ring a bell?</a></span></li></ul></li><li><span><a href="#delete-columns" data-toc-modified-id="delete-columns-6.7"><span class="toc-item-num">6.7&nbsp;&nbsp;</span>delete columns</a></span></li><li><span><a href="#delete-rows" data-toc-modified-id="delete-rows-6.8"><span class="toc-item-num">6.8&nbsp;&nbsp;</span>delete rows</a></span></li><li><span><a href="#Reset_index-and-set_index" data-toc-modified-id="Reset_index-and-set_index-6.9"><span class="toc-item-num">6.9&nbsp;&nbsp;</span>Reset_index and set_index</a></span><ul class="toc-item"><li><span><a href="#SET_INDEX" data-toc-modified-id="SET_INDEX-6.9.1"><span class="toc-item-num">6.9.1&nbsp;&nbsp;</span>SET_INDEX</a></span></li></ul></li><li><span><a href="#Operations-between-columns" data-toc-modified-id="Operations-between-columns-6.10"><span class="toc-item-num">6.10&nbsp;&nbsp;</span>Operations between columns</a></span></li></ul></li><li><span><a href="#Apply-!" data-toc-modified-id="Apply-!-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Apply !</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Passing-a-map-or-an-apply" data-toc-modified-id="Passing-a-map-or-an-apply-7.0.1"><span class="toc-item-num">7.0.1&nbsp;&nbsp;</span>Passing a map or an apply</a></span></li><li><span><a href="#Receive:" data-toc-modified-id="Receive:-7.0.2"><span class="toc-item-num">7.0.2&nbsp;&nbsp;</span>Receive:</a></span></li></ul></li></ul></li><li><span><a href="#Df-.loc-&amp;-.iloc" data-toc-modified-id="Df-.loc-&amp;-.iloc-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Df .loc &amp; .iloc</a></span><ul class="toc-item"><li><span><a href="#Select-rows-and-columns-in-Pandas-by-position-with-iloc" data-toc-modified-id="Select-rows-and-columns-in-Pandas-by-position-with-iloc-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Select rows and columns in Pandas by position with iloc</a></span></li><li><span><a href="#Select-rows-and-columns-in-Pandas-based-on-labels-with-loc" data-toc-modified-id="Select-rows-and-columns-in-Pandas-based-on-labels-with-loc-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>Select rows and columns in Pandas based on labels with loc</a></span><ul class="toc-item"><li><span><a href="#Based-on-label" data-toc-modified-id="Based-on-label-8.2.1"><span class="toc-item-num">8.2.1&nbsp;&nbsp;</span>Based on label</a></span></li></ul></li></ul></li><li><span><a href="#Order-a-dataframe" data-toc-modified-id="Order-a-dataframe-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Order a dataframe</a></span><ul class="toc-item"><li><span><a href="#Look-for-null-values" data-toc-modified-id="Look-for-null-values-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>Look for null values</a></span><ul class="toc-item"><li><span><a href="#It-is-null?" data-toc-modified-id="It-is-null?-9.1.1"><span class="toc-item-num">9.1.1&nbsp;&nbsp;</span>It is null?</a></span></li><li><span><a href="#Is-NOT-null?" data-toc-modified-id="Is-NOT-null?-9.1.2"><span class="toc-item-num">9.1.2&nbsp;&nbsp;</span>Is NOT null?</a></span></li><li><span><a href="#Sum-the-null-values-​​of-each-column" data-toc-modified-id="Sum-the-null-values-​​of-each-column-9.1.3"><span class="toc-item-num">9.1.3&nbsp;&nbsp;</span>Sum the null values ​​of each column</a></span></li></ul></li><li><span><a href="#delete-null-values" data-toc-modified-id="delete-null-values-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span>delete null values</a></span></li><li><span><a href="#How-to-fill-in-the-missing-data" data-toc-modified-id="How-to-fill-in-the-missing-data-9.3"><span class="toc-item-num">9.3&nbsp;&nbsp;</span>How to fill in the missing data</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#CATEGORIES-IN-DATAFRAME:-DOCUMENTATION" data-toc-modified-id="CATEGORIES-IN-DATAFRAME:-DOCUMENTATION-9.3.0.1"><span class="toc-item-num">9.3.0.1&nbsp;&nbsp;</span>CATEGORIES IN DATAFRAME: DOCUMENTATION</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#We-delete-the-duplicates" data-toc-modified-id="We-delete-the-duplicates-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>We delete the duplicates</a></span></li><li><span><a href="#Data-aggregation" data-toc-modified-id="Data-aggregation-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Data aggregation</a></span><ul class="toc-item"><li><span><a href="#GroupBy-&amp;-pivot_table" data-toc-modified-id="GroupBy-&amp;-pivot_table-11.1"><span class="toc-item-num">11.1&nbsp;&nbsp;</span>GroupBy &amp; pivot_table</a></span></li><li><span><a href="#Union-of-Dataframes" data-toc-modified-id="Union-of-Dataframes-11.2"><span class="toc-item-num">11.2&nbsp;&nbsp;</span>Union of Dataframes</a></span></li><li><span><a href="#Concat" data-toc-modified-id="Concat-11.3"><span class="toc-item-num">11.3&nbsp;&nbsp;</span>Concat</a></span><ul class="toc-item"><li><span><a href="#Concatenating-on-axis-0-(rows)" data-toc-modified-id="Concatenating-on-axis-0-(rows)-11.3.1"><span class="toc-item-num">11.3.1&nbsp;&nbsp;</span>Concatenating on axis 0 (rows)</a></span></li><li><span><a href="#Concatenating-on-axis-1-(columns)" data-toc-modified-id="Concatenating-on-axis-1-(columns)-11.3.2"><span class="toc-item-num">11.3.2&nbsp;&nbsp;</span>Concatenating on axis 1 (columns)</a></span></li></ul></li><li><span><a href="#Merge" data-toc-modified-id="Merge-11.4"><span class="toc-item-num">11.4&nbsp;&nbsp;</span>Merge</a></span><ul class="toc-item"><li><span><a href="#LEFT-Merge" data-toc-modified-id="LEFT-Merge-11.4.1"><span class="toc-item-num">11.4.1&nbsp;&nbsp;</span>LEFT Merge</a></span></li><li><span><a href="#RIGHT-Merge" data-toc-modified-id="RIGHT-Merge-11.4.2"><span class="toc-item-num">11.4.2&nbsp;&nbsp;</span>RIGHT Merge</a></span></li><li><span><a href="#INNER-Merge" data-toc-modified-id="INNER-Merge-11.4.3"><span class="toc-item-num">11.4.3&nbsp;&nbsp;</span>INNER Merge</a></span></li><li><span><a href="#OUTER-Merge" data-toc-modified-id="OUTER-Merge-11.4.4"><span class="toc-item-num">11.4.4&nbsp;&nbsp;</span>OUTER Merge</a></span></li></ul></li><li><span><a href="#Join" data-toc-modified-id="Join-11.5"><span class="toc-item-num">11.5&nbsp;&nbsp;</span>Join</a></span></li><li><span><a href="#Differences-between-join-&amp;-merge" data-toc-modified-id="Differences-between-join-&amp;-merge-11.6"><span class="toc-item-num">11.6&nbsp;&nbsp;</span>Differences between join &amp; merge</a></span></li></ul></li><li><span><a href="#Export-data" data-toc-modified-id="Export-data-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Export data</a></span></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Mega-recap" data-toc-modified-id="Mega-recap-14"><span class="toc-item-num">14&nbsp;&nbsp;</span>Mega-recap</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#BASIC-CONCEPTS" data-toc-modified-id="BASIC-CONCEPTS-14.0.1"><span class="toc-item-num">14.0.1&nbsp;&nbsp;</span>BASIC CONCEPTS</a></span></li><li><span><a href="#VISUALIZE-I:-EXPLORE-DATASET" data-toc-modified-id="VISUALIZE-I:-EXPLORE-DATASET-14.0.2"><span class="toc-item-num">14.0.2&nbsp;&nbsp;</span>VISUALIZE I: EXPLORE DATASET</a></span></li><li><span><a href="#CHANGING-THE-DATASET" data-toc-modified-id="CHANGING-THE-DATASET-14.0.3"><span class="toc-item-num">14.0.3&nbsp;&nbsp;</span>CHANGING THE DATASET</a></span></li><li><span><a href="#HANDLING-MISSING-VALUES-&amp;-DUPLICATES" data-toc-modified-id="HANDLING-MISSING-VALUES-&amp;-DUPLICATES-14.0.4"><span class="toc-item-num">14.0.4&nbsp;&nbsp;</span>HANDLING MISSING VALUES &amp; DUPLICATES</a></span></li><li><span><a href="#VISUALIZE-II:-SELECTING-&amp;-ORDERING" data-toc-modified-id="VISUALIZE-II:-SELECTING-&amp;-ORDERING-14.0.5"><span class="toc-item-num">14.0.5&nbsp;&nbsp;</span>VISUALIZE II: SELECTING &amp; ORDERING</a></span></li><li><span><a href="#VISUALIZE-III:-GROUPBY,-AGGREGATIONS" data-toc-modified-id="VISUALIZE-III:-GROUPBY,-AGGREGATIONS-14.0.6"><span class="toc-item-num">14.0.6&nbsp;&nbsp;</span>VISUALIZE III: GROUPBY, AGGREGATIONS</a></span></li><li><span><a href="#AUGMENTING-DATA:-CONCAT,-MERGE-&amp;-JOIN" data-toc-modified-id="AUGMENTING-DATA:-CONCAT,-MERGE-&amp;-JOIN-14.0.7"><span class="toc-item-num">14.0.7&nbsp;&nbsp;</span>AUGMENTING DATA: CONCAT, MERGE &amp; JOIN</a></span></li></ul></li></ul></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-15"><span class="toc-item-num">15&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

# Pandas

![pandas](https://media.giphy.com/media/nVsLCrW5iHf6E/giphy.gif)

## Introduction
Pandas is undoubtedly the most widely used library in the Python ecosystem for data manipulation and analysis. It's fast, powerful, flexible, easy to use and open source.


Among its main features:

- A fast and efficient **DataFrame** object for data manipulation with built-in indexing* 

- **Reading and writing** of data in many formats: Microsoft Excel, CSV, SQL databases, etc;

- Integrated and efficient methods for all types of data manipulation: missing data, subset, union, merge, etc;

- Ease of working with temporary data (in fact, Pandas is named after "PANnel DAta")

- Good **integration with other data analysis or Machine learning libraries**: scikit-learn, scipy, seaborn, plotly, etc;

- It is **widely used** in both the private and academic sectors


Pandas provides high-level data structures and functions designed to make working with structured or tabular data fast, easy, and expressive. Since its introduction in 2010, it has helped make Python a powerful and productive data analysis environment. The main pandas objects that will be used in this book are the DataFrame, a column-oriented tabular data structure with row and column labels, and the Series, a labeled one-dimensional array object.

Pandas combines the high performance ideas of NumPy with the flexible data manipulation capabilities of spreadsheets and relational databases (such as SQL). It provides sophisticated indexing functionality to make it easy to reshape, slice and dice, perform aggregations, and select subsets of data.

![image](https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fgilpress%2Ffiles%2F2016%2F03%2FTime-1200x511.jpg)



Source: [Forbes](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#1ba071616f63)

## Installation

The first thing you should do will always be
`pip install pandas`, `conda install pandas`

In [ ]:
import pandas as pd

## Introduction to pandas data structures
To get started with pandas, you'll need to get comfortable with its two working data structures: Series and DataFrame. Although they are not a universal solution to all problems, they provide a solid and easy-to-use foundation for most applications.

### Series
A Serie is a one-dimensional array object containing a sequence of values ​​(of NumPy-like types) and an associated array of data labels, called its index. The simplest Series is formed from a single array of data:

In [ ]:
import pandas as pd

In [ ]:
my_serie = pd.Series([1, 2, 3, "a string", 4, 5])

In [ ]:
my_serie

In [ ]:
type(my_serie)

In [ ]:
list(my_serie.values)

In [ ]:
list(my_serie.index)

The string representation of a Series displayed interactively shows the index on the left and the values ​​on the right. Since we didn't specify an index for the data, a default one consisting of the integers 0 to N - 1 (where N is the length of the data) is created. You can get the array representation and the index object of the Series through its values ​​and index attributes, respectively:

Another way to think of a Series is as a fixed-length ordered dict, since it is a mapping of index values ​​to data values. It can be used in many contexts where a dictionary could be used.
If you have data contained in a Python dict, you can create a Series from it by passing the dict:

In [ ]:
somedata = {
    "Ohio": 3000,
    "Texas": 3030,
    "Oregon":34343,
    "Utah":4949,
    "Something else": 223
}

In [ ]:
somedata_series = pd.Series(somedata)

In [ ]:
somedata_series

In [ ]:
somedata_series.index

When only one dict is passed, the resulting String index will have the keys of the dict in order. You can override this by passing the keys of the dict in the order you want them to appear in the resulting String:

In [ ]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [ ]:
somedata_series = pd.Series(somedata, index=states)
somedata_series

In [ ]:
#class Series ():
    #def __init__ (self, data, index=None):
        #pass

Here, the three values ​​found in sdata were placed in the appropriate places, but since no value was found for 'California', it appears as NaN (not a number), which is considered in pandas to mark missing values ​​or NA. Since "Utah" was not included in the states, it is excluded from the resulting object.

In [ ]:
import numpy as np

In [ ]:
somedata_series["Ohio"]

In [ ]:
type(somedata_series["Ohio"])

In [ ]:
somedata_series["California"]

In [ ]:
type(somedata_series["California"])

In [ ]:
# Cannot do operation with type float -> is there some NaN in that column/row?

### Find NaN values
NaN stands for Not A Number and is one of the common ways to represent the missing value in the data. It is a special floating point value and cannot be converted to a type other than float.
The NaN value is one of the main problems in data analysis. It is very essential to deal with NaN to get the desired results.

In [ ]:
pd.isnull(somedata_series)

In [ ]:
pd.isna(somedata_series)

In [ ]:
pd.isnull(somedata_series).sum()

## Read/write data

Pandas can read and write data from a wide variety of formats. [Read the documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
Although one of the most common is from a dict of lists of equal length or NumPy arrays:

In [ ]:
#Be mindful of case sensitivity when instantiating pandas objects
df = pd.dataFrame(data)

In [ ]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, None, 2.4, 2.9, np.nan]}

In [ ]:
df = pd.DataFrame(data)
df

In [ ]:
display(df)

If I create a dataframe through a list of dictionaries:
- Each dictionary will be a row
- The keys will be the names of the columns
- They have to have the same structure

In [ ]:
pd.DataFrame.from_dict(data, orient="Index")

Since we are using Jupyter Notebook, pandas DataFrame objects will be displayed as a more browser-friendly HTML table.

In [ ]:
data_2 = [
    {"name":"clara",
    "age": 30},
    
    {"name":"pau",
    "age":19},
    
    {"name":"albert",
    "age":30}
]

In [ ]:
pd.DataFrame(data_2)

### We load data in CSV format

In [ ]:
df = pd.read_csv("../datasets/avocado_kaggle.csv")

In [ ]:
df

In [ ]:
df.head(2)

In [ ]:
df.tail(3)

In [ ]:
new_dataset = df.sample(frac=0.15)
new_dataset

In [ ]:
df.info()

In [ ]:
df.loc[3]

In [ ]:
df.head(3)

In [ ]:
# Shape returns the number of columns and rows into a tuple
# Accessing shape is faster than running the method count, as it's an attribute

In [ ]:
df.shape[0]

In [ ]:
df.count()

In [ ]:
# csv = comma separated values

### We load data in xlsx format

In [ ]:
#retail = pd.read_excel("../datasets/Online Retail.xlsx")
#retail

### We display the first rows

In [ ]:
df.head()

By default head shows me the first 5 rows, I can see some more or less by passing a number as a parameter

In [ ]:
df.head(3)

### We display the last rows

In [ ]:
df.tail()

Exactly the same as with .head() we pass a parameter to .tail()

In [ ]:
df.tail(10)

### Visualize a random sample

In [ ]:
df.sample()

In [ ]:
df.sample(2)

In [ ]:
df.sample(frac=0.1)

## Exploratory analysis of a dataframe

In [ ]:
df

In [ ]:
df.info()

In [ ]:
df.shape

In [ ]:
df.describe() #statistics

In [ ]:
df.describe(percentiles=[0.10,0.50,0.95]) #statistics defining percentiles

In [ ]:
df.head(1)

In [ ]:
df.sample(frac=0.01)

In [ ]:
df.columns

## Basic operations with dataframes

In [ ]:
df['Total Bags'].max()

In [ ]:
df["Date"].min()

In [ ]:
df.AveragePrice.mean()

In [ ]:
df.type.value_counts() #type is the name of the column

In [ ]:
list(df.columns)

In [ ]:
df["type"].value_counts()

In [ ]:
df["Total Bags"].sum()

### We select a column

In [ ]:
df.sample()

In [ ]:
df["columm"]
df.Column

### We select several columns

In [ ]:
df[["Date", "Total Bags"]].head()

In [ ]:
new_list = list(df.columns)[6:]
new_list

In [ ]:
new_variable = df[new_list].head()
new_variable

### Get the unique values ​​of a column (ie a Series)

In [ ]:
df["region"].unique()

### Change the data type of a column

In [ ]:
df["AveragePrice"] # The type is float

In [ ]:
df["AveragePrice"].astype(dtype="int8") #This reduces in size and also 
df["AveragePrice"] #truncates the decimals

# I need to save it, otherwise it won't be changes

### We filter the data by the value of the columns

In [ ]:
df.sample()

In [ ]:
df[df["region"] !="Boston"] #Whole DF where condition is met

In [ ]:
df[(df["region"] =="Boston") & (df.AveragePrice < 1)] #AveragePrice >= 1.10

In [ ]:
df[(df["region"] =="Boston") & ((df.AveragePrice < 1) | (df["Total Bags"] < 1000))] #AveragePrice >= 1.10

In [ ]:
df[((df["region"] =="Boston") | (df["region"] =="Albany")) & (df["AveragePrice"] < 1)]

### Copy a dataframe and rename columns

In [ ]:
my_copy = df.copy()
my_copy

#### Rename columns
To rename columns we need a dictionary

In [ ]:
my_columns = list(df.columns)
my_columns

In [ ]:
my_columns_changed = {column: column.lower().strip().replace(" ", "_").replace(":","") for column in my_columns}
my_columns_changed

The rename method allows me to rename only the columns that I want, the ones that are in the dictionary. No need to rename all at once

In [ ]:
df.rename(columns = my_columns_changed, inplace=True)
df.sample()

# inplace=True will make sure that I save those changes without the need to save it 
# into a new variable

#### We can rename the columns by crushing the instance attribute... does this ring a bell?
Requires a list with the same number of columns

In [ ]:
my_columns_2 = [i.upper() for i in my_columns]

In [ ]:
my_columns_2

In [ ]:
df.columns = my_columns_2

In [ ]:
df.columns

In [ ]:
df.sample()

In [ ]:
minor_change = {
    "DATE":"dates"
}

In [ ]:
df.rename(columns=minor_change, inplace=True)
df.sample()

### delete columns

In [ ]:
df.sample()

In [ ]:
df.drop(["4046", "4770"], axis=1, inplace=True) #Inplace = will save those changes
#into the version you're working with
#It will save you from saving into another variable
#Either inplace=True OR save changes into new_df
df.sample()

In [ ]:
new_df = df.drop(["YEAR", "TYPE"], axis=1) #Inplace = will save those changes
new_df.sample()

In [ ]:
df.drop(["4225"], axis=1) # No inplace & no new_df
df.sample()

In [ ]:
df[["AVERAGEPRICE", "TOTAL VOLUME"]]

### delete rows

In [ ]:
df.head()

In [ ]:
df.drop([6, 7], axis=0, inplace=True)

In [ ]:
df.head()

In [ ]:
#df.to_csv("path")
#df.read_csv("path")

Rows can also be deleted. Note that the indexes are not reset. The index is associated with the row, not the order.
Can the index be restarted? Correct

### Reset_index and set_index

We read the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html) to understand some parameters

#### SET_INDEX

In [ ]:
df.head(5)

In [ ]:
df.reset_index(inplace=True, drop=True) #drop=True will prevent the index to be appended into the DF
df.head(5)

In [ ]:
df.drop(["index"], axis=1, inplace=True) #this works
df.sample()

In [ ]:
df.sample()

In [ ]:
df_dates = df.set_index("dates")
df_dates

What can we use to have the date as an index?
We will see it later, to analyze temporary series

In [ ]:
import seaborn as sns
sns.set_context("poster")
sns.set(rc={'figure.figsize': (20.,6.)})
sns.set_style('whitegrid')

In [ ]:
df_dates.sample()

In [ ]:
sns.lineplot(data=df_dates, x=df_dates.index, y=df["AVERAGEPRICE"])

### Operations between columns

In [ ]:
df.sample()

In [ ]:
#I can create new columns just by assigning a name
df["small_large"] = df["SMALL BAGS"] * df["LARGE BAGS"]
df.sample()

In [ ]:
df["small_large"].max()

In [ ]:
df["small_large"].min()

## Apply !

Applies a function along an axis of the DataFrame.
[Read the docs](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)

When I do an apply on a column, even though I use a lambda, I don't put axis because in the case below, what I'm doing is modifying a column, I use lambda to tell the apply that the first argument is a string that comes from outside and the second argument is the dataframe's own record.

In [ ]:
df.sample()

In [ ]:
#df["new_total_bags"] = #int(itself)

In [ ]:
def into_int (x):
    if x < 1000:
        return int(x)
    else:
        return 0

In [ ]:
df["new_total_bags"] = df["TOTAL BAGS"].apply(into_int) #the value is implicit and corresponds 
#to the row of the column I'm calling: TOTAL BAGS
df.sample(2)

The same way map receives a function and something it iteraves over
A DF is composed of numpy.arrays. So it's an iterable


#### Passing a map or an apply
- map -> function, iterable
- apply -> function, iterable


#### Receive:

- apply & user-defined function -> apply(function) "x", a value
- apply & lambda -> lambda row: row["column"]

In [ ]:
df.sample(5)

In [ ]:
df["brand_new_column"] = df.apply(lambda row: row["REGION"]  if row["YEAR"] > 2015 else "Something", axis = 1)
df.sample()


# Here lambda receives the whole row (a Seabsries)
# Series an element for every column
# Because the whole row, I can access the value of that cell through the label row["LABEL"]

In [ ]:
df.sample(5)

In [ ]:
def startswithletter (letter, x):
    if x.startswith(letter):
        return x
    else:
        return f"It doesn't start with {letter}"

In [ ]:
#Q: Can you pass a function to a lambda? 

df["yetanotherone"] = df.region.apply(lambda cell: (startswith("L", cell)))

In [ ]:
df["yetanotherone"] = df["REGION"].apply(lambda x: x.lower())

In [ ]:
df.sample()

## Df .loc & .iloc

### Select rows and columns in Pandas by position with iloc

loc syntax with multiple conditions
```python
df.loc[(df["column"] condition) & (df["column"] condition)]
````

The iloc method is used on DataFrames to select elements based on their location. Its syntax is data.iloc[<filas>, <columnas>], where <filas> and <columnas> are the position of the rows and columns that you want to select in the order that they appear in the object. A familiar notation for Matlab users. In a DataFrame, each of the rows has a number that goes from 0 to the total number of rows minus one. Being iloc the method that allows selecting the data based on these numbers. The same applies to columns.

In iloc there are two arguments rows and columns. In case the second is omitted, all columns in the row will be selected. So to select different rows can be used.

### Select rows and columns in Pandas based on labels with loc
The loc method can be used in two different ways: select rows or columns based on a label, or select rows or columns based on a condition.

In [ ]:
df.sample(5)

In [ ]:
df.loc[1361] #

In [ ]:
df.iloc[5:10, 3:7] #Integersb

#### Based on label

In [ ]:
df.loc[df["REGION"]=="California"]

In [ ]:
#Reading
df_index_date = pd.read_csv("../datasets/avocado_kaggle.csv")

#Setting the index as the date
df_index_date = df.set_index("date")
df_index_date.head()

# Accessing the row bu it's label
df_index_date.loc["2015-12-06"].head()

## Order a dataframe

In [ ]:
df.sample()

In [ ]:
df.sort_values(by="TOTAL VOLUME", ascending=False).head()

Same operation, but give me only concrete columns

In [ ]:
new_df = df.loc[(df["YEAR"] > 2016) & (df["REGION"] != "Albany")]
new_df.sample()

In [ ]:
df["new_column_based_on_date"] = df.apply(lambda x: f"{x['YEAR']} after 2015" if x["TOTAL VOLUME"] > 1000 else f"Before {x['YEAR']}", axis=1)
df.sample()

### Look for null values

In [ ]:
import seaborn as sns

In [ ]:
df_titanic = sns.load_dataset("titanic")
df_titanic.head()

In [ ]:
df_titanic.shape

#### It is null?

In [ ]:
df_titanic.isnull()

In [ ]:
df_titanic.isna()

In [ ]:
df_titanic.isna().sum()

In [ ]:
# Total number of NaN in df in all columns

total_nan_in_df = df_titanic.isna().sum().sum()
total_nan_in_df #just sum() the sum()

In [ ]:
df_titanic.notna().sum()

In [ ]:
df.info()

#### Is NOT null?

In [455]:
df.notnull()

,UNNAMED: 0,dates,AVERAGEPRICE,TOTAL VOLUME,4225,TOTAL BAGS,SMALL BAGS,LARGE BAGS,XLARGE BAGS,TYPE,YEAR,REGION,small_large,new_t89otal_bags,new_total_bags,brand_new_column,yetanotherone,new_column_based_on_date,new column
0,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18238,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
18239,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
18240,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
18241,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
18242,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True

#### Sum the null values ​​of each column

In [456]:
df.notnull().sum()

UNNAMED: 0                  18243
dates                       18243
AVERAGEPRICE                18243
TOTAL VOLUME                18243
4225                        18243
TOTAL BAGS                  18243
SMALL BAGS                  18243
LARGE BAGS                  18243
XLARGE BAGS                 18243
TYPE                        18243
YEAR                        18243
REGION                      18243
small_large                 18243
new_t89otal_bags            18243
new_total_bags              18243
brand_new_column            18243
yetanotherone               18243
new_column_based_on_date    18243
new column                  18243
dtype: int64

### delete null values
There are several ways to do this, we take into account the "how" parameter and of course [the docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html).

In [ ]:
df_titanic.shape[0]

In [ ]:
#Q: What if I want to target only one column for NaN
#You can select a subset by passind subset = []
#Read the docs: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.dropna.html

In [ ]:
test1 = df_titanic.dropna(subset=["age"])
test1

In [ ]:
test1.isna().sum()

REMEMBER THAT INPLACE TRUE IS FOR THE METHOD TO ACTION ON THE DF, IF NOT, I HAVE TO SAVE IT IN A NEW VARIABLE

With "any" (parameter that comes by default so be careful not to put anything) all the records in which there is a NaN in any column are deleted

In [ ]:
test_2 = df_titanic.dropna(how="any")

In [ ]:
test_2.shape[0]

### How to fill in the missing data

How about a little [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html)?

In [ ]:
df_titanic["deck"].unique()

In [ ]:
df_titanic["age"].isna().sum()

In [ ]:
df_titanic["age"].fillna(df_titanic["age"].mean(), inplace=True)

In [ ]:
df_titanic["age"].isna().sum()

##### CATEGORIES IN DATAFRAME: DOCUMENTATION
https://runebook.dev/en/docs/pandas/user_guide/categorical

## We delete the duplicates

[Read the docs](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.duplicated.html)

In [ ]:
df_titanic.duplicated().sum()

In [ ]:
df_titanic.shape[0]

In [ ]:
# I want to remove duplicated values on ONE column
df_titanic.drop_duplicates(subset = ["id"]inplace=True)

In [ ]:
# What if I want to remove BOTH entries for the same ID if it's repeated: 
# It won't work, as this is an example and ID doesn't exist as a column

df_titanic.drop_duplicates(subset = ["id"], keep=False, inplace=True)

In [ ]:
df_titanic.shape[0]

In [ ]:
df.sample(2)

In [ ]:
df_titanic.sa

In [ ]:
list(df["REGION"].unique()) == list(df["REGION"])

In [ ]:
# How to check for two fields no to hold the same value in different rows
# df.isduplicated(subset=["column1", "column2"])

In [ ]:
df_titanic["sex"].value_counts()

In [ ]:
df.sample()

In [ ]:
df.duplicated(subset=["REGION"]).sum()

In [ ]:
df.shape[0]

In [ ]:
df["REGION"].value_counts()

In [ ]:
# How can I check for duplicated values inside of given column:

In [ ]:
people = [
    {"name":"albert",
    "age":30},
    
    {"name":"albert",
    "age":22},
    
    {"name":"clara",
    "age":20},
    
    {"name":"albert"}
]

In [ ]:
new_df_check = pd.DataFrame(people)

In [ ]:
new_df_check

In [ ]:
new_df_check.duplicated(subset=["name"])

## Data aggregation
### GroupBy & pivot_table
Pandas GroupBy is a powerful and versatile function in Python. It allows us to split your data into separate groups to perform calculations for better analysis.
A DataFrame can be grouped on its rows (axis=0) or on its columns (axis=1). Once this is done, a function is applied to each group, producing a new value. Finally, the results of all those function applications are combined into a result object. The shape of the resulting object will usually depend on what is done with the data.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'],'data1' : np.random.randn(5),'data2' : np.random.randn(5)})

In [4]:
df

  key1 key2     data1     data2
0    a  one  0.843416  1.438067
1    a  two -1.343623 -0.758478
2    b  one -0.541530 -0.065344
3    b  two  1.231416 -0.716515
4    a  one  0.275489 -1.306232

Suppose we want to calculate the mean of column data1 using the labels of key1. There are several ways to do it. One is to access data1 and call groupby with the column (a String) in key1.
The data (a Series) has been aggregated based on the group key, producing a new String that is now indexed by the unique values ​​of the key1 column. The resulting index has the name 'key1' because the DataFrame column `df['key1']` did.

`CUANTITATIVE.groupby(CATEGORICAL).calculation()`

In [8]:
df["data1"].groupby(df["key1"]).mean()

key1
a   -0.074906
b    0.344943
Name: data1, dtype: float64

In [15]:
df.data1.mean()

0.09303346470927018

In [14]:
df.groupby("key1").agg({"data1":"mean", "data2":"sum"})

         data1     data2
key1
a    -0.074906 -0.626644
b     0.344943 -0.781859

Another way to groupby with agg syntax
https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.aggregate.html

- mean
- sum
-count

### Union of Dataframes
- https://realpython.com/pandas-merge-join-and-concat/
- https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html


### Concat
We join dataframes along axis 0 one below the other. Align columns by label.

In [16]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',
                             sep='|', 
                             index_col='user_id')

df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [17]:
first_df = df.sample(frac=0.01)
second_df = df.sample(frac=0.01)

In [18]:
first_df.head()

         age gender occupation zip_code
user_id
501       22      M    student    10025
817       19      M    student    60152
54        22      M  executive    66315
885       30      F      other    95316
759       20      F    student    68503

In [19]:
second_df.head()

         age gender occupation zip_code
user_id
165       20      F      other    53715
477       23      F    student    02125
906       45      M  librarian    70124
708       26      F  homemaker    96349
831       21      M      other    33765

#### Concatenating on axis 0 (rows)

In [21]:
concatenated_axis_0 = pd.concat([first_df, second_df], axis=0, keys=["first", "second"]) #keys: optional
concatenated_axis_0

                age gender     occupation zip_code
       user_id
first  501       22      M        student    10025
       817       19      M        student    60152
       54        22      M      executive    66315
       885       30      F          other    95316
       759       20      F        student    68503
       480       57      M        retired    98257
       268       24      M       engineer    19422
       362       35      F      homemaker    85233
       92        32      M  entertainment    80525
second 165       20      F          other    53715
       477       23      F        student    02125
       906       45      M      librarian    70124
       708       26      F      homemaker    96349
       831       21      M          other    33765
       670       30      M     technician    21114
       408       23      M        student    61755
       397       17      M        student    27514
       835       44      F      executive    11577

#### Concatenating on axis 1 (columns)

In [22]:
concatenated_axis_1 = pd.concat([first_df, second_df], axis=1,  keys=["first", "second"]) #keys: optional)
concatenated_axis_1

        first                                second                     \
          age gender     occupation zip_code    age gender  occupation
user_id
501      22.0      M        student    10025    NaN    NaN         NaN
817      19.0      M        student    60152    NaN    NaN         NaN
54       22.0      M      executive    66315    NaN    NaN         NaN
885      30.0      F          other    95316    NaN    NaN         NaN
759      20.0      F        student    68503    NaN    NaN         NaN
480      57.0      M        retired    98257    NaN    NaN         NaN
268      24.0      M       engineer    19422    NaN    NaN         NaN
362      35.0      F      homemaker    85233    NaN    NaN         NaN
92       32.0      M  entertainment    80525    NaN    NaN         NaN
165       NaN    NaN            NaN      NaN   20.0      F       other
477       NaN    NaN            NaN      NaN   23.0      F     student
906       NaN    NaN            NaN      NaN   45.0      M   librarian
708       NaN    NaN            NaN      NaN   26.0      F   homemaker
831       NaN    NaN            NaN      NaN   21.0      M       other
670       NaN    NaN            NaN      NaN   30.0      M  technician
408       NaN    NaN            NaN      NaN   23.0      M     student
397       NaN    NaN            NaN      NaN   17.0      M     student
835       NaN    NaN            NaN      NaN   44.0      F   executive


        zip_code
user_id
501          NaN
817          NaN
54           NaN
885          NaN
759          NaN
480          NaN
268          NaN
362          NaN
92           NaN
165        53715
477        02125
906        70124
708        96349
831        33765
670        21114
408        61755
397        27514
835        11577

### Merge

[Merge()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html) is most useful when you want to merge rows that share data.

In [28]:
import numpy as np
import pandas as pd   
from IPython.display import display_html

In [29]:
df1 = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)


df2 = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

In [30]:
result = pd.merge(df1, df2, on=["key1", "key2"]) 


#Rendering the df's in the same line. No need to learn this code

df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

,key1,key2,A,B
0,K0,K0,A0,B0
1,K0,K1,A1,B1
2,K1,K0,A2,B2
3,K2,K1,A3,B3
,key1,key2,C,D
0,K0,K0,C0,D0
1,K1,K0,C1,D1
2,K1,K0,C2,D2
3,K2,K0,C3,D3

#### LEFT Merge

In [33]:
result = pd.merge(df1, df2, how="left", on=["key1", "key2"]) 

#Rendering the df's in the same line. No need to learn this code

df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
df1_df2_merged = result.style.set_table_attributes("style='display:inline'").set_caption('LEFT MERGE')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + df1_df2_merged._repr_html_(), raw=True)
#display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

#### RIGHT Merge

In [37]:
result = pd.merge(df1, df2, how="right", on=["key1", "key2"]) 


#Rendering the df's in the same line. No need to learn this code

df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
df1_df2_merged = result.style.set_table_attributes("style='display:inline'").set_caption('RIGHT MERGE')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + df1_df2_merged._repr_html_(), raw=True)
#display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

#### INNER Merge

In [39]:
result = pd.merge(df1, df2, how="inner", on=["key1", "key2"]) 

#Rendering the df's in the same line. No need to learn this code

df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
df1_df2_merged = result.style.set_table_attributes("style='display:inline'").set_caption('INNER MERGE')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + df1_df2_merged._repr_html_(), raw=True)
#display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

#### OUTER Merge

In [40]:
result = pd.merge(df1, df2, how="outer", on=["key1", "key2"]) 

#Rendering the df's in the same line. No need to learn this code

df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
df1_df2_merged = result.style.set_table_attributes("style='display:inline'").set_caption('OUTER MERGE')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + df1_df2_merged._repr_html_(), raw=True)
#display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

### Join
The join, unlike the merge, will join the dataframes and where there are no records in the "index" it will put NaN

In [41]:
import numpy as np
import pandas as pd   
from IPython.display import display_html

In [43]:
left_df = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)


right_df = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

In [45]:
result = left_df.join(right_df)

#Rendering the df's in the same line. No need to learn this code

df1_styler = left_df.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = right_df.style.set_table_attributes("style='display:inline'").set_caption('Right table')
df1_df2_merged = result.style.set_table_attributes("style='display:inline'").set_caption('JOIN')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + df1_df2_merged._repr_html_(), raw=True)
#display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

### Differences between join & merge

<figure class="wp-block-table is-style-stripes"><table class="has-fixed-layout"><thead><tr><th><strong>Join Feature</strong></th><th class="has-text-align-center" data-align="center"><strong>join()</strong></th><th class="has-text-align-center" data-align="center"><strong>merge()</strong></th></tr></thead><tbody><tr><td>inner</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>left</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>right</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>outer</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>cross</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Join on Indices</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Join on Columns</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Left on column, right on index</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Left on index, right on column</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr></tbody></table><figcaption>pandas join vs merge</figcaption></figure>

## Export data

In [ ]:
df.to_csv("../datasets/exported_example.csv")

## Pandas usual methods
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.info(memory_usage='deep')
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values ​​of a column
df.col.unique() # returns unique values ​​from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Mega-recap
It's your turn, what have we learned today?

- Series & DataFrames
- How to use Pandas to create a DF
- We can create through csv files, through dictionaries, and imports in general (excel files)
- We can make Series -> 1d arrays: content & index
- We can create new columns on a DataFrame and change them
- We can create subsets: `df[["one column", "another column"]]`
- You can filter by passing conditions to the subset `df[(condition) & (condition)]` 
- You can change the index: you can reset it to new values, and also to an existing column. Eg.: date, states
- You can export a new DataFrame: `pd.to_csv("path")` 
- You can check for specific values in columns: filtering
- You can calculate some descriptive statistics: mean, count, sd, median, sum
- We can drop (delete) rows and columns: `df["column"].drop(axis=1, inplace=False)` 
- You can do simple operations
- Renaming: overwrite the columns attribute | pass a dictionary, it'll map they Keys and change it for the values: `{"Dates":"date"}` 
- You can create new columns using existing ones (operations)
- You can sort by columns
- Check for duplicates: delete those duplicates, delete two entries if they are repeated in a given column: Eg.: `df.duplicated(subset=["name"])` 
 - Handling missing values: we can input new values to the NaN: eg.: substitue missing values with the mean of that column
 - Exploring dataset, get a quick view: `df.head(int)`, `df.tail(int)`, `df.sample(int)`
 - Eploration of the dataset: `df.info`, `df.shape`, `df.describe` (descriptive statistics)
 - You can access the index: df.index
 - We can copy a df so we don't overwrite: `df.copy()` 
 - ⚠️: We can be SUPER careful when dropping missing values: double check if we want drop every row that holds at leas t ONE NaN or we only want to drop rows that are entirely NaN
 - For the future: We can generate LinePlots using seaborn: generate a timeseries by using the date as the index of a df 
 - To save the changes: save it into a variable | use inplace=True
 -  `loc` & `iloc` for locating rows: ranges/int (iloc), labels(loc)
 - Unique values



# GROUPING
b¡
- Groupby columns and do calculation to that grouping
- Merge, join & concat: putting different sources of tables together
- Concat: just stacks things. It puts them phisically together
- Merge & join: return values where they match, depending on the type of join
- Left / right: prioritizing those values on that table. Then NaN for those that don't match
- Inner: retrieving all of the values that are in common -> smaller df
- Outer: retrieve all of the values, no matter the NaN -> bigger df

![sql joins](https://upload.wikimedia.org/wikipedia/commons/9/9d/SQL_Joins.svg)

#### BASIC CONCEPTS


#### VISUALIZE I: EXPLORE DATASET


#### CHANGING THE DATASET


#### HANDLING MISSING VALUES & DUPLICATES

- [Handling categorical missing values](https://pandas.pydata.org/docs/reference/api/pandas.Series.cat.add_categories.html)


#### VISUALIZE II: SELECTING & ORDERING


#### VISUALIZE III: GROUPBY, AGGREGATIONS


#### AUGMENTING DATA: CONCAT, MERGE & JOIN

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)